; domain
(define (domain EMERGENCY_SERVICES_LOGISTICS)
  (:requirements :action-costs :strips :typing)
  (:types
    phys_object location crate_type num container - object
    helicopter victim crate carrier - phys_object
    helicopter carrier - container
    )
  (:constants
    food_crate medicine_crate - crate_type
    depot - location


    n0 n1 n2 n3 n4 - num
    )
  (:predicates
    (at ?o - phys_object ?l - location)
    (has_crate ?v - victim ?t - crate_type)
    (contains ?h - container ?c - crate)
    (empty ?h - helicopter)
    (can_be_taken ?c - crate)
    (is_type ?c - crate ?t - crate_type)
    (nb_loaded_crates ?r - carrier ?n - num)

    (next ?numA - num ?numB - num)
    )

  (:functions
    (total-cost) - number
    (fly-cost ?from - location ?to - location) - number
    )

  (:action move
   :parameters (?h - helicopter ?from - location ?to - location)
   :precondition
   (and
    (at ?h ?from)
    )
   :effect
   (and
    (at ?h ?to)
    (not (at ?h ?from))
    (increase (total-cost) (fly-cost ?from ?to))
    )
   )

  (:action pick_up
   :parameters (?h - helicopter ?c - crate ?l - location)
   :precondition
   (and
    (at ?h ?l)
    (at ?c ?l)
    (empty ?h)
    (can_be_taken ?c))
   :effect 
   (and 
    (not
    (empty ?h))
    (not (can_be_taken ?c))
    (contains ?h ?c)
    (not (at ?c ?l))
    (increase (total-cost) 10)
    )
   )

  (:action give
   :parameters (?h - helicopter ?c - crate ?v - victim ?l - location ?t - crate_type)
   :precondition
   (and 
    (contains ?h ?c)
    (is_type ?c ?t)
    (at ?h ?l) (at ?v ?l)
    )
   :effect
   (and
    (empty ?h)
    (can_be_taken ?c)
    (not (contains ?h ?c))
    (has_crate ?v ?t)
    (increase (total-cost) 10)
    )
   )

  (:action load_crate_on_carrier
   :parameters (?h - helicopter ?r - carrier ?c - crate ?l - location ?nb_loaded - num ?new_nb_loaded - num)
   :precondition
   (and
    (at ?h ?l)
    (at ?r ?l)
    (contains ?h ?c)
    (nb_loaded_crates ?r ?nb_loaded)
    (next ?nb_loaded ?new_nb_loaded)
    )
   :effect
   (and
     (not (nb_loaded_crates ?r ?nb_loaded))
     (nb_loaded_crates ?r ?new_nb_loaded)
     (not (contains ?h ?c))
     (contains ?r ?c)
     (increase (total-cost) 10)
     (empty ?h)
     )
   )

  (:action fly_carrier
    :parameters (?h - helicopter ?r - carrier ?from - location ?to - location)
    :precondition
    (and
      (empty ?h)
      (at ?h ?from)
      (at ?r ?from)
      )
    :effect
    (and
      (not (at ?h ?from)) (at ?h ?to)
      (not (at ?r ?from)) (at ?r ?to)
      (increase (total-cost) (fly-cost ?from ?to))
      )
    )

  (:action take_crate_from_carrier
    :parameters (?h - helicopter ?r - carrier ?c - crate ?l - location ?nb_loaded - num ?new_nb_loaded - num)
    :precondition
    (and
      (at ?h ?l)
      (at ?r ?l)
      (contains ?r ?c)
      (empty ?h)
      (nb_loaded_crates ?r ?nb_loaded)
      (next ?new_nb_loaded ?nb_loaded)
      )
    :effect
    (and
      (not (contains ?r ?c))
      (not (empty ?h))
      (contains ?h ?c)
      (not (nb_loaded_crates ?r ?nb_loaded)) (nb_loaded_crates ?r ?new_nb_loaded)
      (increase (total-cost) 10)
      )
    )
  )

; problem
(define (problem helicopter_problem_4_1_20_20_20c14c6_5)
(:domain EMERGENCY_SERVICES_LOGISTICS)
(:objects
	helicopter1 - helicopter
	helicopter2 - helicopter
	helicopter3 - helicopter
	helicopter4 - helicopter
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	food_crate - crate_type
	medicine_crate - crate_type
	person1 - victim
	person2 - victim
	person3 - victim
	person4 - victim
	person5 - victim
	person6 - victim
	person7 - victim
	person8 - victim
	person9 - victim
	person10 - victim
	person11 - victim
	person12 - victim
	person13 - victim
	person14 - victim
	person15 - victim
	person16 - victim
	person17 - victim
	person18 - victim
	person19 - victim
	person20 - victim
	carrier1 - carrier
)
(:init
	(next n0 n1)
	(next n1 n2)
	(next n2 n3)
	(next n3 n4)
	(= (total-cost) 0)
	(is_type crate1 food_crate)
	(at crate1 depot)
	(can_be_taken crate1)
	(is_type crate2 food_crate)
	(at crate2 depot)
	(can_be_taken crate2)
	(is_type crate3 food_crate)
	(at crate3 depot)
	(can_be_taken crate3)
	(is_type crate4 food_crate)
	(at crate4 depot)
	(can_be_taken crate4)
	(is_type crate5 food_crate)
	(at crate5 depot)
	(can_be_taken crate5)
	(is_type crate6 food_crate)
	(at crate6 depot)
	(can_be_taken crate6)
	(is_type crate7 food_crate)
	(at crate7 depot)
	(can_be_taken crate7)
	(is_type crate8 food_crate)
	(at crate8 depot)
	(can_be_taken crate8)
	(is_type crate9 food_crate)
	(at crate9 depot)
	(can_be_taken crate9)
	(is_type crate10 food_crate)
	(at crate10 depot)
	(can_be_taken crate10)
	(is_type crate11 food_crate)
	(at crate11 depot)
	(can_be_taken crate11)
	(is_type crate12 food_crate)
	(at crate12 depot)
	(can_be_taken crate12)
	(is_type crate13 food_crate)
	(at crate13 depot)
	(can_be_taken crate13)
	(is_type crate14 food_crate)
	(at crate14 depot)
	(can_be_taken crate14)
	(is_type crate15 medicine_crate)
	(at crate15 depot)
	(can_be_taken crate15)
	(is_type crate16 medicine_crate)
	(at crate16 depot)
	(can_be_taken crate16)
	(is_type crate17 medicine_crate)
	(at crate17 depot)
	(can_be_taken crate17)
	(is_type crate18 medicine_crate)
	(at crate18 depot)
	(can_be_taken crate18)
	(is_type crate19 medicine_crate)
	(at crate19 depot)
	(can_be_taken crate19)
	(is_type crate20 medicine_crate)
	(at crate20 depot)
	(can_be_taken crate20)
	(at helicopter1 depot)
	(empty helicopter1)
	(at helicopter2 depot)
	(empty helicopter2)
	(at helicopter3 depot)
	(empty helicopter3)
	(at helicopter4 depot)
	(empty helicopter4)
	(at person1 loc5)
	(at person2 loc1)
	(at person3 loc6)
	(at person4 loc17)
	(at person5 loc2)
	(at person6 loc3)
	(at person7 loc12)
	(at person8 loc5)
	(at person9 loc14)
	(at person10 loc14)
	(at person11 loc7)
	(at person12 loc9)
	(at person13 loc17)
	(at person14 loc14)
	(at person15 loc15)
	(at person16 loc3)
	(at person17 loc17)
	(at person18 loc1)
	(at person19 loc15)
	(at person20 loc16)
	(at carrier1  depot)
	(= (fly-cost depot depot) 1)
	(= (fly-cost depot loc1) 86)
	(= (fly-cost depot loc2) 91)
	(= (fly-cost depot loc3) 226)
	(= (fly-cost depot loc4) 228)
	(= (fly-cost depot loc5) 105)
	(= (fly-cost depot loc6) 112)
	(= (fly-cost depot loc7) 83)
	(= (fly-cost depot loc8) 101)
	(= (fly-cost depot loc9) 192)
	(= (fly-cost depot loc10) 165)
	(= (fly-cost depot loc11) 46)
	(= (fly-cost depot loc12) 161)
	(= (fly-cost depot loc13) 187)
	(= (fly-cost depot loc14) 143)
	(= (fly-cost depot loc15) 176)
	(= (fly-cost depot loc16) 178)
	(= (fly-cost depot loc17) 178)
	(= (fly-cost depot loc18) 102)
	(= (fly-cost depot loc19) 172)
	(= (fly-cost depot loc20) 177)
	(= (fly-cost loc1 depot) 86)
	(= (fly-cost loc1 loc1) 1)
	(= (fly-cost loc1 loc2) 87)
	(= (fly-cost loc1 loc3) 158)
	(= (fly-cost loc1 loc4) 160)
	(= (fly-cost loc1 loc5) 112)
	(= (fly-cost loc1 loc6) 76)
	(= (fly-cost loc1 loc7) 107)
	(= (fly-cost loc1 loc8) 83)
	(= (fly-cost loc1 loc9) 125)
	(= (fly-cost loc1 loc10) 170)
	(= (fly-cost loc1 loc11) 59)
	(= (fly-cost loc1 loc12) 76)
	(= (fly-cost loc1 loc13) 102)
	(= (fly-cost loc1 loc14) 84)
	(= (fly-cost loc1 loc15) 91)
	(= (fly-cost loc1 loc16) 93)
	(= (fly-cost loc1 loc17) 92)
	(= (fly-cost loc1 loc18) 98)
	(= (fly-cost loc1 loc19) 122)
	(= (fly-cost loc1 loc20) 98)
	(= (fly-cost loc2 depot) 91)
	(= (fly-cost loc2 loc1) 87)
	(= (fly-cost loc2 loc2) 1)
	(= (fly-cost loc2 loc3) 152)
	(= (fly-cost loc2 loc4) 155)
	(= (fly-cost loc2 loc5) 26)
	(= (fly-cost loc2 loc6) 36)
	(= (fly-cost loc2 loc7) 33)
	(= (fly-cost loc2 loc8) 16)
	(= (fly-cost loc2 loc9) 122)
	(= (fly-cost loc2 loc10) 86)
	(= (fly-cost loc2 loc11) 50)
	(= (fly-cost loc2 loc12) 141)
	(= (fly-cost loc2 loc13) 158)
	(= (fly-cost loc2 loc14) 74)
	(= (fly-cost loc2 loc15) 155)
	(= (fly-cost loc2 loc16) 160)
	(= (fly-cost loc2 loc17) 150)
	(= (fly-cost loc2 loc18) 13)
	(= (fly-cost loc2 loc19) 89)
	(= (fly-cost loc2 loc20) 125)
	(= (fly-cost loc3 depot) 226)
	(= (fly-cost loc3 loc1) 158)
	(= (fly-cost loc3 loc2) 152)
	(= (fly-cost loc3 loc3) 1)
	(= (fly-cost loc3 loc4) 4)
	(= (fly-cost loc3 loc5) 161)
	(= (fly-cost loc3 loc6) 119)
	(= (fly-cost loc3 loc7) 182)
	(= (fly-cost loc3 loc8) 137)
	(= (fly-cost loc3 loc9) 34)
	(= (fly-cost loc3 loc10) 168)
	(= (fly-cost loc3 loc11) 181)
	(= (fly-cost loc3 loc12) 126)
	(= (fly-cost loc3 loc13) 111)
	(= (fly-cost loc3 loc14) 83)
	(= (fly-cost loc3 loc15) 126)
	(= (fly-cost loc3 loc16) 132)
	(= (fly-cost loc3 loc17) 113)
	(= (fly-cost loc3 loc18) 150)
	(= (fly-cost loc3 loc19) 67)
	(= (fly-cost loc3 loc20) 70)
	(= (fly-cost loc4 depot) 228)
	(= (fly-cost loc4 loc1) 160)
	(= (fly-cost loc4 loc2) 155)
	(= (fly-cost loc4 loc3) 4)
	(= (fly-cost loc4 loc4) 1)
	(= (fly-cost loc4 loc5) 164)
	(= (fly-cost loc4 loc6) 121)
	(= (fly-cost loc4 loc7) 185)
	(= (fly-cost loc4 loc8) 139)
	(= (fly-cost loc4 loc9) 37)
	(= (fly-cost loc4 loc10) 171)
	(= (fly-cost loc4 loc11) 183)
	(= (fly-cost loc4 loc12) 127)
	(= (fly-cost loc4 loc13) 111)
	(= (fly-cost loc4 loc14) 86)
	(= (fly-cost loc4 loc15) 126)
	(= (fly-cost loc4 loc16) 132)
	(= (fly-cost loc4 loc17) 113)
	(= (fly-cost loc4 loc18) 153)
	(= (fly-cost loc4 loc19) 70)
	(= (fly-cost loc4 loc20) 71)
	(= (fly-cost loc5 depot) 105)
	(= (fly-cost loc5 loc1) 112)
	(= (fly-cost loc5 loc2) 26)
	(= (fly-cost loc5 loc3) 161)
	(= (fly-cost loc5 loc4) 164)
	(= (fly-cost loc5 loc5) 1)
	(= (fly-cost loc5 loc6) 54)
	(= (fly-cost loc5 loc7) 27)
	(= (fly-cost loc5 loc8) 35)
	(= (fly-cost loc5 loc9) 134)
	(= (fly-cost loc5 loc10) 63)
	(= (fly-cost loc5 loc11) 70)
	(= (fly-cost loc5 loc12) 165)
	(= (fly-cost loc5 loc13) 179)
	(= (fly-cost loc5 loc14) 90)
	(= (fly-cost loc5 loc15) 178)
	(= (fly-cost loc5 loc16) 183)
	(= (fly-cost loc5 loc17) 172)
	(= (fly-cost loc5 loc18) 16)
	(= (fly-cost loc5 loc19) 95)
	(= (fly-cost loc5 loc20) 144)
	(= (fly-cost loc6 depot) 112)
	(= (fly-cost loc6 loc1) 76)
	(= (fly-cost loc6 loc2) 36)
	(= (fly-cost loc6 loc3) 119)
	(= (fly-cost loc6 loc4) 121)
	(= (fly-cost loc6 loc5) 54)
	(= (fly-cost loc6 loc6) 1)
	(= (fly-cost loc6 loc7) 68)
	(= (fly-cost loc6 loc8) 21)
	(= (fly-cost loc6 loc9) 87)
	(= (fly-cost loc6 loc10) 99)
	(= (fly-cost loc6 loc11) 67)
	(= (fly-cost loc6 loc12) 114)
	(= (fly-cost loc6 loc13) 127)
	(= (fly-cost loc6 loc14) 39)
	(= (fly-cost loc6 loc15) 126)
	(= (fly-cost loc6 loc16) 132)
	(= (fly-cost loc6 loc17) 120)
	(= (fly-cost loc6 loc18) 39)
	(= (fly-cost loc6 loc19) 60)
	(= (fly-cost loc6 loc20) 91)
	(= (fly-cost loc7 depot) 83)
	(= (fly-cost loc7 loc1) 107)
	(= (fly-cost loc7 loc2) 33)
	(= (fly-cost loc7 loc3) 182)
	(= (fly-cost loc7 loc4) 185)
	(= (fly-cost loc7 loc5) 27)
	(= (fly-cost loc7 loc6) 68)
	(= (fly-cost loc7 loc7) 1)
	(= (fly-cost loc7 loc8) 48)
	(= (fly-cost loc7 loc9) 153)
	(= (fly-cost loc7 loc10) 83)
	(= (fly-cost loc7 loc11) 56)
	(= (fly-cost loc7 loc12) 170)
	(= (fly-cost loc7 loc13) 188)
	(= (fly-cost loc7 loc14) 106)
	(= (fly-cost loc7 loc15) 184)
	(= (fly-cost loc7 loc16) 188)
	(= (fly-cost loc7 loc17) 180)
	(= (fly-cost loc7 loc18) 33)
	(= (fly-cost loc7 loc19) 118)
	(= (fly-cost loc7 loc20) 157)
	(= (fly-cost loc8 depot) 101)
	(= (fly-cost loc8 loc1) 83)
	(= (fly-cost loc8 loc2) 16)
	(= (fly-cost loc8 loc3) 137)
	(= (fly-cost loc8 loc4) 139)
	(= (fly-cost loc8 loc5) 35)
	(= (fly-cost loc8 loc6) 21)
	(= (fly-cost loc8 loc7) 48)
	(= (fly-cost loc8 loc8) 1)
	(= (fly-cost loc8 loc9) 106)
	(= (fly-cost loc8 loc10) 88)
	(= (fly-cost loc8 loc11) 57)
	(= (fly-cost loc8 loc12) 130)
	(= (fly-cost loc8 loc13) 145)
	(= (fly-cost loc8 loc14) 59)
	(= (fly-cost loc8 loc15) 143)
	(= (fly-cost loc8 loc16) 148)
	(= (fly-cost loc8 loc17) 138)
	(= (fly-cost loc8 loc18) 20)
	(= (fly-cost loc8 loc19) 75)
	(= (fly-cost loc8 loc20) 111)
	(= (fly-cost loc9 depot) 192)
	(= (fly-cost loc9 loc1) 125)
	(= (fly-cost loc9 loc2) 122)
	(= (fly-cost loc9 loc3) 34)
	(= (fly-cost loc9 loc4) 37)
	(= (fly-cost loc9 loc5) 134)
	(= (fly-cost loc9 loc6) 87)
	(= (fly-cost loc9 loc7) 153)
	(= (fly-cost loc9 loc8) 106)
	(= (fly-cost loc9 loc9) 1)
	(= (fly-cost loc9 loc10) 151)
	(= (fly-cost loc9 loc11) 147)
	(= (fly-cost loc9 loc12) 101)
	(= (fly-cost loc9 loc13) 91)
	(= (fly-cost loc9 loc14) 51)
	(= (fly-cost loc9 loc15) 103)
	(= (fly-cost loc9 loc16) 109)
	(= (fly-cost loc9 loc17) 91)
	(= (fly-cost loc9 loc18) 122)
	(= (fly-cost loc9 loc19) 46)
	(= (fly-cost loc9 loc20) 44)
	(= (fly-cost loc10 depot) 165)
	(= (fly-cost loc10 loc1) 170)
	(= (fly-cost loc10 loc2) 86)
	(= (fly-cost loc10 loc3) 168)
	(= (fly-cost loc10 loc4) 171)
	(= (fly-cost loc10 loc5) 63)
	(= (fly-cost loc10 loc6) 99)
	(= (fly-cost loc10 loc7) 83)
	(= (fly-cost loc10 loc8) 88)
	(= (fly-cost loc10 loc9) 151)
	(= (fly-cost loc10 loc10) 1)
	(= (fly-cost loc10 loc11) 132)
	(= (fly-cost loc10 loc12) 211)
	(= (fly-cost loc10 loc13) 220)
	(= (fly-cost loc10 loc14) 123)
	(= (fly-cost loc10 loc15) 223)
	(= (fly-cost loc10 loc16) 228)
	(= (fly-cost loc10 loc17) 214)
	(= (fly-cost loc10 loc18) 74)
	(= (fly-cost loc10 loc19) 106)
	(= (fly-cost loc10 loc20) 177)
	(= (fly-cost loc11 depot) 46)
	(= (fly-cost loc11 loc1) 59)
	(= (fly-cost loc11 loc2) 50)
	(= (fly-cost loc11 loc3) 181)
	(= (fly-cost loc11 loc4) 183)
	(= (fly-cost loc11 loc5) 70)
	(= (fly-cost loc11 loc6) 67)
	(= (fly-cost loc11 loc7) 56)
	(= (fly-cost loc11 loc8) 57)
	(= (fly-cost loc11 loc9) 147)
	(= (fly-cost loc11 loc10) 132)
	(= (fly-cost loc11 loc11) 1)
	(= (fly-cost loc11 loc12) 131)
	(= (fly-cost loc11 loc13) 154)
	(= (fly-cost loc11 loc14) 98)
	(= (fly-cost loc11 loc15) 146)
	(= (fly-cost loc11 loc16) 149)
	(= (fly-cost loc11 loc17) 145)
	(= (fly-cost loc11 loc18) 62)
	(= (fly-cost loc11 loc19) 126)
	(= (fly-cost loc11 loc20) 136)
	(= (fly-cost loc12 depot) 161)
	(= (fly-cost loc12 loc1) 76)
	(= (fly-cost loc12 loc2) 141)
	(= (fly-cost loc12 loc3) 126)
	(= (fly-cost loc12 loc4) 127)
	(= (fly-cost loc12 loc5) 165)
	(= (fly-cost loc12 loc6) 114)
	(= (fly-cost loc12 loc7) 170)
	(= (fly-cost loc12 loc8) 130)
	(= (fly-cost loc12 loc9) 101)
	(= (fly-cost loc12 loc10) 211)
	(= (fly-cost loc12 loc11) 131)
	(= (fly-cost loc12 loc12) 1)
	(= (fly-cost loc12 loc13) 29)
	(= (fly-cost loc12 loc14) 92)
	(= (fly-cost loc12 loc15) 16)
	(= (fly-cost loc12 loc16) 19)
	(= (fly-cost loc12 loc17) 21)
	(= (fly-cost loc12 loc18) 149)
	(= (fly-cost loc12 loc19) 126)
	(= (fly-cost loc12 loc20) 58)
	(= (fly-cost loc13 depot) 187)
	(= (fly-cost loc13 loc1) 102)
	(= (fly-cost loc13 loc2) 158)
	(= (fly-cost loc13 loc3) 111)
	(= (fly-cost loc13 loc4) 111)
	(= (fly-cost loc13 loc5) 179)
	(= (fly-cost loc13 loc6) 127)
	(= (fly-cost loc13 loc7) 188)
	(= (fly-cost loc13 loc8) 145)
	(= (fly-cost loc13 loc9) 91)
	(= (fly-cost loc13 loc10) 220)
	(= (fly-cost loc13 loc11) 154)
	(= (fly-cost loc13 loc12) 29)
	(= (fly-cost loc13 loc13) 1)
	(= (fly-cost loc13 loc14) 98)
	(= (fly-cost loc13 loc15) 19)
	(= (fly-cost loc13 loc16) 23)
	(= (fly-cost loc13 loc17) 10)
	(= (fly-cost loc13 loc18) 164)
	(= (fly-cost loc13 loc19) 125)
	(= (fly-cost loc13 loc20) 49)
	(= (fly-cost loc14 depot) 143)
	(= (fly-cost loc14 loc1) 84)
	(= (fly-cost loc14 loc2) 74)
	(= (fly-cost loc14 loc3) 83)
	(= (fly-cost loc14 loc4) 86)
	(= (fly-cost loc14 loc5) 90)
	(= (fly-cost loc14 loc6) 39)
	(= (fly-cost loc14 loc7) 106)
	(= (fly-cost loc14 loc8) 59)
	(= (fly-cost loc14 loc9) 51)
	(= (fly-cost loc14 loc10) 123)
	(= (fly-cost loc14 loc11) 98)
	(= (fly-cost loc14 loc12) 92)
	(= (fly-cost loc14 loc13) 98)
	(= (fly-cost loc14 loc14) 1)
	(= (fly-cost loc14 loc15) 102)
	(= (fly-cost loc14 loc16) 108)
	(= (fly-cost loc14 loc17) 92)
	(= (fly-cost loc14 loc18) 76)
	(= (fly-cost loc14 loc19) 40)
	(= (fly-cost loc14 loc20) 56)
	(= (fly-cost loc15 depot) 176)
	(= (fly-cost loc15 loc1) 91)
	(= (fly-cost loc15 loc2) 155)
	(= (fly-cost loc15 loc3) 126)
	(= (fly-cost loc15 loc4) 126)
	(= (fly-cost loc15 loc5) 178)
	(= (fly-cost loc15 loc6) 126)
	(= (fly-cost loc15 loc7) 184)
	(= (fly-cost loc15 loc8) 143)
	(= (fly-cost loc15 loc9) 103)
	(= (fly-cost loc15 loc10) 223)
	(= (fly-cost loc15 loc11) 146)
	(= (fly-cost loc15 loc12) 16)
	(= (fly-cost loc15 loc13) 19)
	(= (fly-cost loc15 loc14) 102)
	(= (fly-cost loc15 loc15) 1)
	(= (fly-cost loc15 loc16) 7)
	(= (fly-cost loc15 loc17) 14)
	(= (fly-cost loc15 loc18) 163)
	(= (fly-cost loc15 loc19) 133)
	(= (fly-cost loc15 loc20) 60)
	(= (fly-cost loc16 depot) 178)
	(= (fly-cost loc16 loc1) 93)
	(= (fly-cost loc16 loc2) 160)
	(= (fly-cost loc16 loc3) 132)
	(= (fly-cost loc16 loc4) 132)
	(= (fly-cost loc16 loc5) 183)
	(= (fly-cost loc16 loc6) 132)
	(= (fly-cost loc16 loc7) 188)
	(= (fly-cost loc16 loc8) 148)
	(= (fly-cost loc16 loc9) 109)
	(= (fly-cost loc16 loc10) 228)
	(= (fly-cost loc16 loc11) 149)
	(= (fly-cost loc16 loc12) 19)
	(= (fly-cost loc16 loc13) 23)
	(= (fly-cost loc16 loc14) 108)
	(= (fly-cost loc16 loc15) 7)
	(= (fly-cost loc16 loc16) 1)
	(= (fly-cost loc16 loc17) 20)
	(= (fly-cost loc16 loc18) 167)
	(= (fly-cost loc16 loc19) 139)
	(= (fly-cost loc16 loc20) 66)
	(= (fly-cost loc17 depot) 178)
	(= (fly-cost loc17 loc1) 92)
	(= (fly-cost loc17 loc2) 150)
	(= (fly-cost loc17 loc3) 113)
	(= (fly-cost loc17 loc4) 113)
	(= (fly-cost loc17 loc5) 172)
	(= (fly-cost loc17 loc6) 120)
	(= (fly-cost loc17 loc7) 180)
	(= (fly-cost loc17 loc8) 138)
	(= (fly-cost loc17 loc9) 91)
	(= (fly-cost loc17 loc10) 214)
	(= (fly-cost loc17 loc11) 145)
	(= (fly-cost loc17 loc12) 21)
	(= (fly-cost loc17 loc13) 10)
	(= (fly-cost loc17 loc14) 92)
	(= (fly-cost loc17 loc15) 14)
	(= (fly-cost loc17 loc16) 20)
	(= (fly-cost loc17 loc17) 1)
	(= (fly-cost loc17 loc18) 157)
	(= (fly-cost loc17 loc19) 122)
	(= (fly-cost loc17 loc20) 47)
	(= (fly-cost loc18 depot) 102)
	(= (fly-cost loc18 loc1) 98)
	(= (fly-cost loc18 loc2) 13)
	(= (fly-cost loc18 loc3) 150)
	(= (fly-cost loc18 loc4) 153)
	(= (fly-cost loc18 loc5) 16)
	(= (fly-cost loc18 loc6) 39)
	(= (fly-cost loc18 loc7) 33)
	(= (fly-cost loc18 loc8) 20)
	(= (fly-cost loc18 loc9) 122)
	(= (fly-cost loc18 loc10) 74)
	(= (fly-cost loc18 loc11) 62)
	(= (fly-cost loc18 loc12) 149)
	(= (fly-cost loc18 loc13) 164)
	(= (fly-cost loc18 loc14) 76)
	(= (fly-cost loc18 loc15) 163)
	(= (fly-cost loc18 loc16) 167)
	(= (fly-cost loc18 loc17) 157)
	(= (fly-cost loc18 loc18) 1)
	(= (fly-cost loc18 loc19) 85)
	(= (fly-cost loc18 loc20) 129)
	(= (fly-cost loc19 depot) 172)
	(= (fly-cost loc19 loc1) 122)
	(= (fly-cost loc19 loc2) 89)
	(= (fly-cost loc19 loc3) 67)
	(= (fly-cost loc19 loc4) 70)
	(= (fly-cost loc19 loc5) 95)
	(= (fly-cost loc19 loc6) 60)
	(= (fly-cost loc19 loc7) 118)
	(= (fly-cost loc19 loc8) 75)
	(= (fly-cost loc19 loc9) 46)
	(= (fly-cost loc19 loc10) 106)
	(= (fly-cost loc19 loc11) 126)
	(= (fly-cost loc19 loc12) 126)
	(= (fly-cost loc19 loc13) 125)
	(= (fly-cost loc19 loc14) 40)
	(= (fly-cost loc19 loc15) 133)
	(= (fly-cost loc19 loc16) 139)
	(= (fly-cost loc19 loc17) 122)
	(= (fly-cost loc19 loc18) 85)
	(= (fly-cost loc19 loc19) 1)
	(= (fly-cost loc19 loc20) 77)
	(= (fly-cost loc20 depot) 177)
	(= (fly-cost loc20 loc1) 98)
	(= (fly-cost loc20 loc2) 125)
	(= (fly-cost loc20 loc3) 70)
	(= (fly-cost loc20 loc4) 71)
	(= (fly-cost loc20 loc5) 144)
	(= (fly-cost loc20 loc6) 91)
	(= (fly-cost loc20 loc7) 157)
	(= (fly-cost loc20 loc8) 111)
	(= (fly-cost loc20 loc9) 44)
	(= (fly-cost loc20 loc10) 177)
	(= (fly-cost loc20 loc11) 136)
	(= (fly-cost loc20 loc12) 58)
	(= (fly-cost loc20 loc13) 49)
	(= (fly-cost loc20 loc14) 56)
	(= (fly-cost loc20 loc15) 60)
	(= (fly-cost loc20 loc16) 66)
	(= (fly-cost loc20 loc17) 47)
	(= (fly-cost loc20 loc18) 129)
	(= (fly-cost loc20 loc19) 77)
	(= (fly-cost loc20 loc20) 1)
)
(:goal (and

	(at helicopter1 depot)

	(at helicopter2 depot)

	(at helicopter3 depot)

	(at helicopter4 depot)
	(has_crate person3 food_crate)
	(has_crate person6 food_crate)
	(has_crate person14 medicine_crate)
	(has_crate person19 medicine_crate)
	(has_crate person20 medicine_crate)
	))
)

; plan
1. (pick_up helicopter2 crate4 depot)
   deleted: (empty helicopter2) (can_be_taken crate4) (at crate4 depot)
   added: (contains helicopter2 crate4)
   goals met: 4 of 9
2. (pick_up helicopter1 crate12 depot)
   deleted: (empty helicopter1) (can_be_taken crate12) (at crate12 depot)
   added: (contains helicopter1 crate12)
   goals met: 4 of 9
3. (move helicopter1 depot loc6)
   deleted: (at helicopter1 depot)
   added: (at helicopter1 loc6)
   goals met: 3 of 9
4. (move helicopter2 depot loc3)
   deleted: (at helicopter2 depot)
   added: (at helicopter2 loc3)
   goals met: 2 of 9
5. (give helicopter1 crate12 person3 loc6 food_crate)
   deleted: (contains helicopter1 crate12)
   added: (empty helicopter1) (can_be_taken crate12) (has_crate person3 food_crate)
   goals met: 3 of 9
6. (move helicopter1 loc6 loc14)
   deleted: (at helicopter1 loc6)
   added: (at helicopter1 loc14)
   goals met: 3 of 9
7. (move helicopter1 loc14 loc15)
   deleted: (at helicopter1 loc14)
   added: (at helicopter1 loc15)
   goals met: 3 of 9
8. (give helicopter2 crate4 person6 loc3 food_crate)
   deleted: (contains helicopter2 crate4)
   added: (empty helicopter2) (can_be_taken crate4) (has_crate person6 food_crate)
   goals met: 4 of 9
9. (move helicopter2 loc3 loc6)
   deleted: (at helicopter2 loc3)
   added: (at helicopter2 loc6)
   goals met: 4 of 9
10. (move helicopter1 loc15 depot)
   deleted: (at helicopter1 loc15)
   added: (at helicopter1 depot)
   goals met: 5 of 9
11. (move helicopter2 loc6 loc14)
   deleted: (at helicopter2 loc6)
   added: (at helicopter2 loc14)
   goals met: 5 of 9
12. (move helicopter2 loc14 loc15)
   deleted: (at helicopter2 loc14)
   added: (at helicopter2 loc15)
   goals met: 5 of 9
13. (pick_up helicopter1 crate15 depot)
   deleted: (empty helicopter1) (can_be_taken crate15) (at crate15 depot)
   added: (contains helicopter1 crate15)
   goals met: 5 of 9
14. (move helicopter1 depot loc15)
   deleted: (at helicopter1 depot)
   added: (at helicopter1 loc15)
   goals met: 4 of 9
15. (move helicopter2 loc15 loc16)
   deleted: (at helicopter2 loc15)
   added: (at helicopter2 loc16)
   goals met: 4 of 9
16. (move helicopter2 loc16 depot)
   deleted: (at helicopter2 loc16)
   added: (at helicopter2 depot)
   goals met: 5 of 9
17. (give helicopter1 crate15 person19 loc15 medicine_crate)
   deleted: (contains helicopter1 crate15)
   added: (empty helicopter1) (can_be_taken crate15) (has_crate person19 medicine_crate)
   goals met: 6 of 9
18. (move helicopter1 loc15 depot)
   deleted: (at helicopter1 loc15)
   added: (at helicopter1 depot)
   goals met: 7 of 9
19. (pick_up helicopter2 crate16 depot)
   deleted: (empty helicopter2) (can_be_taken crate16) (at crate16 depot)
   added: (contains helicopter2 crate16)
   goals met: 7 of 9
20. (move helicopter2 depot loc14)
   deleted: (at helicopter2 depot)
   added: (at helicopter2 loc14)
   goals met: 6 of 9
21. (give helicopter2 crate16 person14 loc14 medicine_crate)
   deleted: (contains helicopter2 crate16)
   added: (empty helicopter2) (can_be_taken crate16) (has_crate person14 medicine_crate)
   goals met: 7 of 9
22. (move helicopter2 loc14 loc15)
   deleted: (at helicopter2 loc14)
   added: (at helicopter2 loc15)
   goals met: 7 of 9
23. (move helicopter2 loc15 loc16)
   deleted: (at helicopter2 loc15)
   added: (at helicopter2 loc16)
   goals met: 7 of 9
24. (move helicopter2 loc16 depot)
   deleted: (at helicopter2 loc16)
   added: (at helicopter2 depot)
   goals met: 8 of 9
25. (pick_up helicopter2 crate18 depot)
   deleted: (empty helicopter2) (can_be_taken crate18) (at crate18 depot)
   added: (contains helicopter2 crate18)
   goals met: 8 of 9
26. (move helicopter2 depot loc16)
   deleted: (at helicopter2 depot)
   added: (at helicopter2 loc16)
   goals met: 7 of 9
27. (give helicopter2 crate18 person20 loc16 medicine_crate)
   deleted: (contains helicopter2 crate18)
   added: (empty helicopter2) (can_be_taken crate18) (has_crate person20 medicine_crate)
   goals met: 8 of 9
28. (move helicopter2 loc16 depot)
   deleted: (at helicopter2 loc16)
   added: (at helicopter2 depot)
   goals met: 9 of 9
